import dateCalc

print("日付妥当性判定プログラムテスト")
      
testData =  (\
                (    0,  1,  1 ), (    1,  1,  1 ),\
                ( 5000, 12, 31 ), ( 5001,  1,  1 ),\
                ( 2021,  0,  1 ), ( 2021,  1,  1 ),\
                ( 2021, 12, 31 ), ( 2021, 13,  1 ),\
                ( 2021,  1,  0 ), ( 2021,  1,  1 ),\
                ( 2021,  1, 31 ), ( 2021,  1, 32 ),\
                ( 2021,  2, 28 ), ( 2021,  2, 29 ),\
                ( 2020,  2, 29 ), ( 2020,  2, 30 )\
            )
for data in testData :
    print( f"{data[0]}/{data[1]}/{data[2]} : {dateCalc.dateCheck( data[0], data[1], data[2] )}" )
